tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1786_tdd.h
#define BUF1                          522
#define SSP1BUF1                      523
#define BUF2                          524
#define SSP1BUF2                      525
#define BUF3                          526
#define SSP1BUF3                      527
#define BUF4                          528
#define SSP1BUF4                      529
#define BUF5                          530
#define SSP1BUF5                      531
#define BUF6                          532
#define SSP1BUF6                      533
#define BUF7                          534
#define SSP1BUF7                      535
#define ADD0                          536
#define ADD                           537
#define SSP1ADD0                      538
#define SSP1ADD                       539
#define ADD1                          540
#define SSP1ADD1                      541
#define ADD2                          542
#define SSP1ADD2                      543
#define ADD3                          544
#define SSP1ADD3                      545
#define ADD4                          546
#define SSP1ADD4                      547
#define ADD5                          548
#define SSP1ADD5                      549
#define ADD6                          550
#define SSP1ADD6                      551
#define ADD7                          552
#define SSP1ADD7                      553
#define SSP1MSK0                      554
#define SSP1MSK                       555
#define MSK0                          556
#define MSK                           557
#define SSP1MSK1                      558
#define MSK1                          559
#define SSP1MSK2                      560
#define MSK2                          561
#define SSP1MSK3                      562
#define MSK3                          563
#define SSP1MSK4                      564
#define MSK4                          565
#define SSP1MSK5                      566
#define MSK5                          567
#define SSP1MSK6                      568
#define MSK6                          569
#define SSP1MSK7                      570
#define MSK7                          571
#define SSP1STAT                      572
#define BF                            573
#define UA                            574
#define R_nW                          575
#define S                             576
#define P                             577
#define D_nA                          578
#define CKE                           579
#define SMP                           580
#define SSP1CON1                      581
#define SSPM0                         582
#define SSPM                          583
#define SSPM1                         584
#define SSPM2                         585
#define SSPM3                         586
#define CKP                           587
#define SSPEN                         588
#define SSPOV                         589
#define WCOL                          590
#define SSP1CON2                      591
#define SEN                           592
#define RSEN                          593
#define PEN                           594
#define RCEN                          595
#define ACKEN                         596
#define ACKDT                         597
#define ACKSTAT                       598
#define GCEN                          599
#define SSP1CON3                      600
#define DHEN                          601
#define AHEN                          602
#define SBCDE                         603
#define SDAHT                         604
#define BOEN                          605
#define SCIE                          606
#define PCIE                          607
#define ACKTIM                        608
#define ODCONA0                       609
#define ODCONA                        610
#define ODCONA1                       611
#define ODCONA2                       612
#define ODCONA3                       613
#define ODCONA4                       614
#define ODCONA5                       615
#define ODCONA6                       616
#define ODCONA7                       617
#define ODCONB0                       618
#define ODCONB                        619
#define ODCONB1                       620
#define ODCONB2                       621
#define ODCONB3                       622
#define ODCONB4                       623
#define ODCONB5                       624
#define ODCONB6                       625
#define ODCONB7                       626
#define ODCONC0                       627
#define ODCONC                        628
#define ODCONC1                       629
#define ODCONC2                       630
#define ODCONC3                       631
#define ODCONC4                       632
#define ODCONC5                       633
#define ODCONC6                       634
#define ODCONC7                       635
#define CCPR1L                        636
#define CCPR1H                        637
#define CCP1CON                       638
#define CCP1M0                        639
#define CCP1M                         640
#define CCP1M1                        641
#define CCP1M2                        642
#define CCP1M3                        643
#define DC1B                          644
#define DC1B0                         645
#define DC1B1                         646
#define CCPR2L                        647
#define CCPR2H                        648
#define CCP2CON                       649
#define CCP2M                         650
#define CCP2M0                        651
#define CCP2M1                        652
#define CCP2M2                        653
#define CCP2M3                        654
#define DC2B0                         655
#define DC2B                          656
#define DC2B1                         657
#define SLRCONA0                      658
#define SLRCONA                       659
#define SLRCONA1                      660
#define SLRCONA2                      661
#define SLRCONA3                      662
#define SLRCONA4                      663
#define SLRCONA5                      664
#define SLRCONA6                      665
#define SLRCONA7                      666
#define SLRCONB                       667
#define SLRCONB0                      668
#define SLRCONB1                      669
#define SLRCONB2                      670
#define SLRCONB3                      671
#define SLRCONB4                      672
#define SLRCONB5                      673
#define SLRCONB6                      674
#define SLRCONB7                      675
#define SLRCONC                       676
#define SLRCONC0                      677
#define SLRCONC1                      678
#define SLRCONC2                      679
#define SLRCONC3                      680
#define SLRCONC4                      681
#define SLRCONC5                      682
#define SLRCONC6                      683
#define SLRCONC7                      684
#define CCPR3L                        685
#define CCPR3H                        686
#define CCP3CON                       687
#define CCP3M                         688
#define CCP3M0                        689
#define CCP3M1                        690
#define CCP3M2                        691
#define CCP3M3                        692
#define DC3B                          693
#define DC3B0                         694
#define DC3B1                         695
#define INLVLA                        696
#define INLVLA0                       697
#define INLVLA1                       698
#define INLVLA2                       699
#define INLVLA3                       700
#define INLVLA4                       701
#define INLVLA5                       702
#define INLVLA6                       703
#define INLVLA7                       704
#define INLVLB                        705
#define INLVLB0                       706
#define INLVLB1                       707
#define INLVLB2                       708
#define INLVLB3                       709
#define INLVLB4                       710
#define INLVLB5                       711
#define INLVLB6                       712
#define INLVLB7                       713
#define INLVLC                        714
#define INLVLC0                       715
#define INLVLC1                       716
#define INLVLC2                       717
#define INLVLC3                       718
#define INLVLC4                       719
#define INLVLC5                       720
#define INLVLC6                       721
#define INLVLC7                       722
#define INLVLE                        723
#define INLVLE3                       724
#define IOCAP                         725
#define IOCAP0                        726
#define IOCAP1                        727
#define IOCAP2                        728
#define IOCAP3                        729
#define IOCAP4                        730
#define IOCAP5                        731
#define IOCAP6                        732
#define IOCAP7                        733
#define IOCAN                         734
#define IOCAN0                        735
#define IOCAN1                        736
#define IOCAN2                        737
#define IOCAN3                        738
#define IOCAN4                        739
#define IOCAN5                        740
#define IOCAN6                        741
#define IOCAN7                        742
#define IOCAF0                        743
#define IOCAF                         744
#define IOCAF1                        745
#define IOCAF2                        746
#define IOCAF3                        747
#define IOCAF4                        748
#define IOCAF5                        749
#define IOCAF6                        750
#define IOCAF7                        751
#define IOCBP                         752
#define IOCBP0                        753
#define IOCBP1                        754
#define IOCBP2                        755
#define IOCBP3                        756
#define IOCBP4                        757
#define IOCBP5                        758
#define IOCBP6                        759
#define IOCBP7                        760
#define IOCBN0                        761
#define IOCBN                         762
#define IOCBN1                        763
#define IOCBN2                        764
#define IOCBN3                        765
#define IOCBN4                        766
#define IOCBN5                        767
#define IOCBN6                        768
#define IOCBN7                        769
#define IOCBF0                        770
#define IOCBF                         771
#define IOCBF1                        772
#define IOCBF2                        773
#define IOCBF3                        774
#define IOCBF4                        775
#define IOCBF5                        776
#define IOCBF6                        777
#define IOCBF7                        778
#define IOCCP0                        779
#define IOCCP                         780
#define IOCCP1                        781
#define IOCCP2                        782
#define IOCCP3                        783
#define IOCCP4                        784
#define IOCCP5                        785
#define IOCCP6                        786
#define IOCCP7                        787
#define IOCCN0                        788
#define IOCCN                         789
#define IOCCN1                        790
#define IOCCN2                        791
#define IOCCN3                        792
#define IOCCN4                        793
#define IOCCN5                        794
#define IOCCN6                        795
#define IOCCN7                        796
#define IOCCF0                        797
#define IOCCF                         798
#define IOCCF1                        799
#define IOCCF2                        800
#define IOCCF3                        801
#define IOCCF4                        802
#define IOCCF5                        803
#define IOCCF6                        804
#define IOCCF7                        805
#define IOCEP                         806
#define IOCEP3                        807
#define IOCEN                         808
#define IOCEN3                        809
#define IOCEF                         810
#define IOCEF3                        811
#define OPA1CON                       812
#define OPA1CON_PCH                   813
#define OPA1PCH                       814
#define OPA1CON_PCH0                  815
#define OPA1PCH0                      816
#define OPA1CON_PCH1                  817
#define OPA1PCH1                      818
#define OPA1CON_SP                    819
#define OPA1SP                        820
#define OPA1CON_EN                    821
#define OPA1EN                        822
#define OPA2CON                       823
#define OPA2CON_PCH                   824
#define OPA2CON_PCH0                  825
#define OPA2PCH                       826
#define OPA2PCH0                      827
#define OPA2CON_PCH1                  828
#define OPA2PCH1                      829
#define OPA2CON_SP                    830
#define OPA2SP                        831
#define OPA2EN                        832
#define OPA2CON_EN                    833
#define CLKRCON                       834
#define CLKRDIV                       835
#define CLKRDIV0                      836
#define CLKRDIV1                      837
#define CLKRDIV2                      838
#define CLKRDC                        839
#define CLKRDC0                       840
#define CLKRDC1                       841
#define CLKRSLR                       842
#define CLKROE                        843
#define CLKREN                        844
#define PSMC1CON                      845
#define P1MODE                        846
#define P1MODE0                       847
#define P1MODE1                       848
#define P1MODE2                       849
#define P1MODE3                       850
#define P1DBRE                        851
#define P1DBFE                        852
#define PSMC1LD                       853
#define PSMC1EN                       854
#define PSMC1MDL                      855
#define P1MSRC0                       856
#define P1MSRC                        857
#define P1MSRC1                       858
#define P1MSRC2                       859
#define P1MSRC3                       860
#define P1MDLBIT                      861
#define P1MDLPOL                      862
#define P1MDLEN                       863
#define PSMC1SYNC                     864
#define P1SYNC0                       865
#define P1SYNC1                       866
#define P1SYNC2                       867
#define P1DCPOL                       868
#define P1PRPOL                       869
#define P1POFST                       870
#define PSMC1CLK                      871
#define P1CSRC                        872
#define P1CSRC0                       873
#define P1CSRC1                       874
#define P1CPRE                        875
#define P1CPRE0                       876
#define P1CPRE1                       877
#define PSMC1OEN                      878
#define P1OEA                         879
#define P1OEB                         880
#define P1OEC                         881
#define P1OED                         882
#define P1OEE                         883
#define P1OEF                         884
#define PSMC1POL                      885
#define P1POLA                        886
#define P1POLB                        887
#define P1POLC                        888
#define P1POLD                        889
#define P1POLE                        890
#define P1POLF                        891
#define P1INPOL                       892
#define PSMC1BLNK                     893
#define P1REBM                        894
#define P1REBM0                       895
#define P1REBM1                       896
#define P1FEBM0                       897
#define P1FEBM                        898
#define P1FEBM1                       899
#define PSMC1REBS                     900
#define P1REBSC1                      901
#define P1REBSC2                      902
#define P1REBSC3                      903
#define P1REBSC4                      904
#define P1REBSIN                      905
#define PSMC1FEBS                     906
#define P1FEBSC1                      907
#define P1FEBSC2                      908
#define P1FEBSC3                      909
#define P1FEBSC4                      910
#define P1FEBSIN                      911
#define PSMC1PHS                      912
#define P1PHST                        913
#define P1PHSC1                       914
#define P1PHSC2                       915
#define P1PHSC3                       916
#define P1PHSC4                       917
#define P1PHSIN                       918
#define PSMC1DCS                      919
#define P1DCST                        920
#define P1DCSC1                       921
#define P1DCSC2                       922
#define P1DCSC3                       923
#define P1DCSC4                       924
#define P1DCSIN                       925
#define PSMC1PRS                      926
#define P1PRST                        927
#define P1PRSC1                       928
#define P1PRSC2                       929
#define P1PRSC3                       930
#define P1PRSC4                       931
#define P1PRSIN                       932
#define PSMC1ASDC                     933
#define P1ASDOV                       934
#define P1ARSEN                       935
#define P1ASDEN                       936
#define P1ASE                         937
#define PSMC1ASDL                     938
#define P1ASDLA                       939
#define P1ASDLB                       940
#define P1ASDLC                       941
#define P1ASDLD                       942
#define P1ASDLE                       943
#define P1ASDLF                       944
#define PSMC1ASDS                     945
#define P1ASDSC1                      946
#define P1ASDSC2                      947
#define P1ASDSC3                      948
#define P1ASDSC4                      949
#define P1ASDSIN                      950
#define PSMC1INT                      951
#define P1TPRIF                       952
#define P1TDCIF                       953
#define P1TPHIF                       954
#define P1TOVIF                       955
#define P1TPRIE                       956
#define P1TDCIE                       957
#define P1TPHIE                       958
#define P1TOVIE                       959
#define PSMC1PHL                      960
#define PSMC1PH0                      961
#define PSMC1PH1                      962
#define PSMC1PH2                      963
#define PSMC1PH3                      964
#define PSMC1PH4                      965
#define PSMC1PH5                      966
#define PSMC1PH6                      967
#define PSMC1PH7                      968
#define PSMC1PHH                      969
#define PSMC1PH8                      970
#define PSMC1PH9                      971
#define PSMC1PH10                     972
#define PSMC1PH11                     973
#define PSMC1PH12                     974
#define PSMC1PH13                     975
#define PSMC1PH14                     976
#define PSMC1PH15                     977
#define PSMC1DCL                      978
#define PSMC1DC0                      979
#define PSMC1DC1                      980
#define PSMC1DC2                      981
#define PSMC1DC3                      982
#define PSMC1DC4                      983
#define PSMC1DC5                      984
#define PSMC1DC6                      985
#define PSMC1DC7                      986
#define PSMC1DCH                      987
#define PSMC1DC8                      988
#define PSMC1DC9                      989
#define PSMC1DC10                     990
#define PSMC1DC11                     991
#define PSMC1DC12                     992
#define PSMC1DC13                     993
#define PSMC1DC14                     994
#define PSMC1DC15                     995
#define PSMC1PRL                      996
#define PSMC1PR0                      997
#define PSMC1PR1                      998
#define PSMC1PR2                      999
#define PSMC1PR3                      1000
#define PSMC1PR4                      1001
#define PSMC1PR5                      1002
#define PSMC1PR6                      1003
#define PSMC1PR7                      1004
#define PSMC1PRH                      1005
#define PSMC1PR8                      1006
#define PSMC1PR9                      1007
#define PSMC1PR10                     1008
#define PSMC1PR11                     1009
#define PSMC1PR12                     1010
#define PSMC1PR13                     1011
#define PSMC1PR14                     1012
#define PSMC1PR15                     1013
#define PSMC1TMRL                     1014
#define PSMC1TMR0                     1015
#define PSMC1TMR1                     1016
#define PSMC1TMR2                     1017
#define PSMC1TMR3                     1018
#define PSMC1TMR4                     1019
#define PSMC1TMR5                     1020
#define PSMC1TMR6                     1021
#define PSMC1TMR7                     1022
#define PSMC1TMRH                     1023
#define PSMC1TMR8                     1024
#define PSMC1TMR9                     1025
#define PSMC1TMR10                    1026
#define PSMC1TMR11                    1027
#define PSMC1TMR12                    1028
#define PSMC1TMR13                    1029
#define PSMC1TMR14                    1030
#define PSMC1TMR15                    1031
#define PSMC1DBR                      1032
#define PSMC1DBR0                     1033
#define PSMC1DBR1                     1034
#define PSMC1DBR2                     1035
#define PSMC1DBR3                     1036
#define PSMC1DBR4                     1037
#define PSMC1DBR5                     1038
#define PSMC1DBR6                     1039
#define PSMC1DBR7                     1040
#define PSMC1DBF                      1041
#define PSMC1DBF0                     1042
#define PSMC1DBF1                     1043
#define PSMC1DBF2                     1044
#define PSMC1DBF3                     1045
#define PSMC1DBF4                     1046
#define PSMC1DBF5                     1047
#define PSMC1DBF6                     1048
#define PSMC1DBF7                     1049
#define PSMC1BLKR                     1050
#define PSMC1BLKR0                    1051
#define PSMC1BLKR1                    1052
#define PSMC1BLKR2                    1053
#define PSMC1BLKR3                    1054
#define PSMC1BLKR4                    1055
#define PSMC1BLKR5                    1056
#define PSMC1BLKR6                    1057
#define PSMC1BLKR7                    1058
#define PSMC1BLKF                     1059
#define PSMC1BLKF0                    1060
#define PSMC1BLKF1                    1061
#define PSMC1BLKF2                    1062
#define PSMC1BLKF3                    1063
#define PSMC1BLKF4                    1064
#define PSMC1BLKF5                    1065
#define PSMC1BLKF6                    1066
#define PSMC1BLKF7                    1067
#define PSMC1FFA                      1068
#define PSMC1FFA0                     1069
#define PSMC1FFA1                     1070
#define PSMC1FFA2                     1071
#define PSMC1FFA3                     1072
#define PSMC1STR0                     1073
#define P1STRA                        1074
#define P1STRB                        1075
#define P1STRC                        1076
#define P1STRD                        1077
#define P1STRE                        1078
#define P1STRF                        1079
#define PSMC1STR1                     1080
#define P1HSMEN                       1081
#define P1LSMEN                       1082
#define P1SSYNC                       1083
#define PSMC2CON                      1084
#define P2MODE                        1085
#define P2MODE0                       1086
#define P2MODE1                       1087
#define P2MODE2                       1088
#define P2MODE3                       1089
#define P2DBRE                        1090
