tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1786_tdd.h
#define P2DBFE                        1091
#define PSMC2LD                       1092
#define PSMC2EN                       1093
#define PSMC2MDL                      1094
#define P2MSRC                        1095
#define P2MSRC0                       1096
#define P2MSRC1                       1097
#define P2MSRC2                       1098
#define P2MSRC3                       1099
#define P2MDLBIT                      1100
#define P2MDLPOL                      1101
#define P2MDLEN                       1102
#define PSMC2SYNC                     1103
#define P2SYNC0                       1104
#define P2SYNC1                       1105
#define P2SYNC2                       1106
#define P2DCPOL                       1107
#define P2PRPOL                       1108
#define P2POFST                       1109
#define PSMC2CLK                      1110
#define P2CSRC0                       1111
#define P2CSRC                        1112
#define P2CSRC1                       1113
#define P2CPRE                        1114
#define P2CPRE0                       1115
#define P2CPRE1                       1116
#define PSMC2OEN                      1117
#define P2OEA                         1118
#define P2OEB                         1119
#define PSMC2POL                      1120
#define P2POLA                        1121
#define P2POLB                        1122
#define P2INPOL                       1123
#define PSMC2BLNK                     1124
#define P2REBM                        1125
#define P2REBM0                       1126
#define P2REBM1                       1127
#define P2FEBM0                       1128
#define P2FEBM                        1129
#define P2FEBM1                       1130
#define PSMC2REBS                     1131
#define P2REBSC1                      1132
#define P2REBSC2                      1133
#define P2REBSC3                      1134
#define P2REBSC4                      1135
#define P2REBSIN                      1136
#define PSMC2FEBS                     1137
#define P2FEBSC1                      1138
#define P2FEBSC2                      1139
#define P2FEBSC3                      1140
#define P2FEBSC4                      1141
#define P2FEBSIN                      1142
#define PSMC2PHS                      1143
#define P2PHST                        1144
#define P2PHSC1                       1145
#define P2PHSC2                       1146
#define P2PHSC3                       1147
#define P2PHSC4                       1148
#define P2PHSIN                       1149
#define PSMC2DCS                      1150
#define P2DCST                        1151
#define P2DCSC1                       1152
#define P2DCSC2                       1153
#define P2DCSC3                       1154
#define P2DCSC4                       1155
#define P2DCSIN                       1156
#define PSMC2PRS                      1157
#define P2PRST                        1158
#define P2PRSC1                       1159
#define P2PRSC2                       1160
#define P2PRSC3                       1161
#define P2PRSC4                       1162
#define P2PRSIN                       1163
#define PSMC2ASDC                     1164
#define P2ASDOV                       1165
#define P2ARSEN                       1166
#define P2ASDEN                       1167
#define P2ASE                         1168
#define PSMC2ASDL                     1169
#define P2ASDLA                       1170
#define P2ASDLB                       1171
#define PSMC2ASDS                     1172
#define P2ASDSC1                      1173
#define P2ASDSC2                      1174
#define P2ASDSC3                      1175
#define P2ASDSC4                      1176
#define P2ASDSIN                      1177
#define PSMC2INT                      1178
#define P2TPRIF                       1179
#define P2TDCIF                       1180
#define P2TPHIF                       1181
#define P2TOVIF                       1182
#define P2TPRIE                       1183
#define P2TDCIE                       1184
#define P2TPHIE                       1185
#define P2TOVIE                       1186
#define PSMC2PHL                      1187
#define PSMC2PH0                      1188
#define PSMC2PH1                      1189
#define PSMC2PH2                      1190
#define PSMC2PH3                      1191
#define PSMC2PH4                      1192
#define PSMC2PH5                      1193
#define PSMC2PH6                      1194
#define PSMC2PH7                      1195
#define PSMC2PHH                      1196
#define PSMC2PH8                      1197
#define PSMC2PH9                      1198
#define PSMC2PH10                     1199
#define PSMC2PH11                     1200
#define PSMC2PH12                     1201
#define PSMC2PH13                     1202
#define PSMC2PH14                     1203
#define PSMC2PH15                     1204
#define PSMC2DCL                      1205
#define PSMC2DC0                      1206
#define PSMC2DC1                      1207
#define PSMC2DC2                      1208
#define PSMC2DC3                      1209
#define PSMC2DC4                      1210
#define PSMC2DC5                      1211
#define PSMC2DC6                      1212
#define PSMC2DC7                      1213
#define PSMC2DCH                      1214
#define PSMC2DC8                      1215
#define PSMC2DC9                      1216
#define PSMC2DC10                     1217
#define PSMC2DC11                     1218
#define PSMC2DC12                     1219
#define PSMC2DC13                     1220
#define PSMC2DC14                     1221
#define PSMC2DC15                     1222
#define PSMC2PRL                      1223
#define PSMC2PR0                      1224
#define PSMC2PR1                      1225
#define PSMC2PR2                      1226
#define PSMC2PR3                      1227
#define PSMC2PR4                      1228
#define PSMC2PR5                      1229
#define PSMC2PR6                      1230
#define PSMC2PR7                      1231
#define PSMC2PRH                      1232
#define PSMC2PR8                      1233
#define PSMC2PR9                      1234
#define PSMC2PR10                     1235
#define PSMC2PR11                     1236
#define PSMC2PR12                     1237
#define PSMC2PR13                     1238
#define PSMC2PR14                     1239
#define PSMC2PR15                     1240
#define PSMC2TMRL                     1241
#define PSMC2TMR0                     1242
#define PSMC2TMR1                     1243
#define PSMC2TMR2                     1244
#define PSMC2TMR3                     1245
#define PSMC2TMR4                     1246
#define PSMC2TMR5                     1247
#define PSMC2TMR6                     1248
#define PSMC2TMR7                     1249
#define PSMC2TMRH                     1250
#define PSMC2TMR8                     1251
#define PSMC2TMR9                     1252
#define PSMC2TMR10                    1253
#define PSMC2TMR11                    1254
#define PSMC2TMR12                    1255
#define PSMC2TMR13                    1256
#define PSMC2TMR14                    1257
#define PSMC2TMR15                    1258
#define PSMC2DBR                      1259
#define PSMC2DBR0                     1260
#define PSMC2DBR1                     1261
#define PSMC2DBR2                     1262
#define PSMC2DBR3                     1263
#define PSMC2DBR4                     1264
#define PSMC2DBR5                     1265
#define PSMC2DBR6                     1266
#define PSMC2DBR7                     1267
#define PSMC2DBF                      1268
#define PSMC2DBF0                     1269
#define PSMC2DBF1                     1270
#define PSMC2DBF2                     1271
#define PSMC2DBF3                     1272
#define PSMC2DBF4                     1273
#define PSMC2DBF5                     1274
#define PSMC2DBF6                     1275
#define PSMC2DBF7                     1276
#define PSMC2BLKR                     1277
#define PSMC2BLKR0                    1278
#define PSMC2BLKR1                    1279
#define PSMC2BLKR2                    1280
#define PSMC2BLKR3                    1281
#define PSMC2BLKR4                    1282
#define PSMC2BLKR5                    1283
#define PSMC2BLKR6                    1284
#define PSMC2BLKR7                    1285
#define PSMC2BLKF                     1286
#define PSMC2BLKF0                    1287
#define PSMC2BLKF1                    1288
#define PSMC2BLKF2                    1289
#define PSMC2BLKF3                    1290
#define PSMC2BLKF4                    1291
#define PSMC2BLKF5                    1292
#define PSMC2BLKF6                    1293
#define PSMC2BLKF7                    1294
#define PSMC2FFA                      1295
#define PSMC2FFA0                     1296
#define PSMC2FFA1                     1297
#define PSMC2FFA2                     1298
#define PSMC2FFA3                     1299
#define PSMC2STR0                     1300
#define P2STRA                        1301
#define P2STRB                        1302
#define PSMC2STR1                     1303
#define P2HSMEN                       1304
#define P2LSMEN                       1305
#define P2SSYNC                       1306
#define PSMC3CON                      1307
#define P3MODE                        1308
#define P3MODE0                       1309
#define P3MODE1                       1310
#define P3MODE2                       1311
#define P3MODE3                       1312
#define P3DBRE                        1313
#define P3DBFE                        1314
#define PSMC3LD                       1315
#define PSMC3EN                       1316
#define PSMC3MDL                      1317
#define P3MSRC                        1318
#define P3MSRC0                       1319
#define P3MSRC1                       1320
#define P3MSRC2                       1321
#define P3MSRC3                       1322
#define P3MDLBIT                      1323
#define P3MDLPOL                      1324
#define P3MDLEN                       1325
#define PSMC3SYNC                     1326
#define P3SYNC0                       1327
#define P3SYNC1                       1328
#define P3SYNC2                       1329
#define P3DCPOL                       1330
#define P3PRPOL                       1331
#define P3POFST                       1332
#define PSMC3CLK                      1333
#define P3CSRC0                       1334
#define P3CSRC                        1335
#define P3CSRC1                       1336
#define P3CPRE                        1337
#define P3CPRE0                       1338
#define P3CPRE1                       1339
#define PSMC3OEN                      1340
#define P3OEA                         1341
#define P3OEB                         1342
#define PSMC3POL                      1343
#define P3POLA                        1344
#define P3POLB                        1345
#define P3INPOL                       1346
#define PSMC3BLNK                     1347
#define P3REBM                        1348
#define P3REBM0                       1349
#define P3REBM1                       1350
#define P3FEBM                        1351
#define P3FEBM0                       1352
#define P3FEBM1                       1353
#define PSMC3REBS                     1354
#define P3REBSC1                      1355
#define P3REBSC2                      1356
#define P3REBSC3                      1357
#define P3REBSC4                      1358
#define P3REBSIN                      1359
#define PSMC3FEBS                     1360
#define P3FEBSC1                      1361
#define P3FEBSC2                      1362
#define P3FEBSC3                      1363
#define P3FEBSC4                      1364
#define P3FEBSIN                      1365
#define PSMC3PHS                      1366
#define P3PHST                        1367
#define P3PHSC1                       1368
#define P3PHSC2                       1369
#define P3PHSC3                       1370
#define P3PHSC4                       1371
#define P3PHSIN                       1372
#define PSMC3DCS                      1373
#define P3DCST                        1374
#define P3DCSC1                       1375
#define P3DCSC2                       1376
#define P3DCSC3                       1377
#define P3DCSC4                       1378
#define P3DCSIN                       1379
#define PSMC3PRS                      1380
#define P3PRST                        1381
#define P3PRSC1                       1382
#define P3PRSC2                       1383
#define P3PRSC3                       1384
#define P3PRSC4                       1385
#define P3PRSIN                       1386
#define PSMC3ASDC                     1387
#define P3ASDOV                       1388
#define P3ARSEN                       1389
#define P3ASDEN                       1390
#define P3ASE                         1391
#define PSMC3ASDL                     1392
#define P3ASDLA                       1393
#define P3ASDLB                       1394
#define P3ASDLC                       1395
#define P3ASDLD                       1396
#define P3ASDLE                       1397
#define P3ASDLF                       1398
#define PSMC3ASDS                     1399
#define P3ASDSC1                      1400
#define P3ASDSC2                      1401
#define P3ASDSC3                      1402
#define P3ASDSC4                      1403
#define P3ASDSIN                      1404
#define PSMC3INT                      1405
#define P3TPRIF                       1406
#define P3TDCIF                       1407
#define P3TPHIF                       1408
#define P3TOVIF                       1409
#define P3TPRIE                       1410
#define P3TDCIE                       1411
#define P3TPHIE                       1412
#define P3TOVIE                       1413
#define PSMC3PHL                      1414
#define PSMC3PH0                      1415
#define PSMC3PH1                      1416
#define PSMC3PH2                      1417
#define PSMC3PH3                      1418
#define PSMC3PH4                      1419
#define PSMC3PH5                      1420
#define PSMC3PH6                      1421
#define PSMC3PH7                      1422
#define PSMC3PHH                      1423
#define PSMC3PH8                      1424
#define PSMC3PH9                      1425
#define PSMC3PH10                     1426
#define PSMC3PH11                     1427
#define PSMC3PH12                     1428
#define PSMC3PH13                     1429
#define PSMC3PH14                     1430
#define PSMC3PH15                     1431
#define PSMC3DCL                      1432
#define PSMC3DC0                      1433
#define PSMC3DC1                      1434
#define PSMC3DC2                      1435
#define PSMC3DC3                      1436
#define PSMC3DC4                      1437
#define PSMC3DC5                      1438
#define PSMC3DC6                      1439
#define PSMC3DC7                      1440
#define PSMC3DCH                      1441
#define PSMC3DC8                      1442
#define PSMC3DC9                      1443
#define PSMC3DC10                     1444
#define PSMC3DC11                     1445
#define PSMC3DC12                     1446
#define PSMC3DC13                     1447
#define PSMC3DC14                     1448
#define PSMC3DC15                     1449
#define PSMC3PRL                      1450
#define PSMC3PR0                      1451
#define PSMC3PR1                      1452
#define PSMC3PR2                      1453
#define PSMC3PR3                      1454
#define PSMC3PR4                      1455
#define PSMC3PR5                      1456
#define PSMC3PR6                      1457
#define PSMC3PR7                      1458
#define PSMC3PRH                      1459
#define PSMC3PR8                      1460
#define PSMC3PR9                      1461
#define PSMC3PR10                     1462
#define PSMC3PR11                     1463
#define PSMC3PR12                     1464
#define PSMC3PR13                     1465
#define PSMC3PR14                     1466
#define PSMC3PR15                     1467
#define PSMC3TMRL                     1468
#define PSMC3TMR0                     1469
#define PSMC3TMR1                     1470
#define PSMC3TMR2                     1471
#define PSMC3TMR3                     1472
#define PSMC3TMR4                     1473
#define PSMC3TMR5                     1474
#define PSMC3TMR6                     1475
#define PSMC3TMR7                     1476
#define PSMC3TMRH                     1477
#define PSMC3TMR8                     1478
#define PSMC3TMR9                     1479
#define PSMC3TMR10                    1480
#define PSMC3TMR11                    1481
#define PSMC3TMR12                    1482
#define PSMC3TMR13                    1483
#define PSMC3TMR14                    1484
#define PSMC3TMR15                    1485
#define PSMC3DBR                      1486
#define PSMC3DBR0                     1487
#define PSMC3DBR1                     1488
#define PSMC3DBR2                     1489
#define PSMC3DBR3                     1490
#define PSMC3DBR4                     1491
#define PSMC3DBR5                     1492
#define PSMC3DBR6                     1493
#define PSMC3DBR7                     1494
#define PSMC3DBF                      1495
#define PSMC3DBF0                     1496
#define PSMC3DBF1                     1497
#define PSMC3DBF2                     1498
#define PSMC3DBF3                     1499
#define PSMC3DBF4                     1500
#define PSMC3DBF5                     1501
#define PSMC3DBF6                     1502
#define PSMC3DBF7                     1503
#define PSMC3BLKR                     1504
#define PSMC3BLKR0                    1505
#define PSMC3BLKR1                    1506
#define PSMC3BLKR2                    1507
#define PSMC3BLKR3                    1508
#define PSMC3BLKR4                    1509
#define PSMC3BLKR5                    1510
#define PSMC3BLKR6                    1511
#define PSMC3BLKR7                    1512
#define PSMC3BLKF                     1513
#define PSMC3BLKF0                    1514
#define PSMC3BLKF1                    1515
#define PSMC3BLKF2                    1516
#define PSMC3BLKF3                    1517
#define PSMC3BLKF4                    1518
#define PSMC3BLKF5                    1519
#define PSMC3BLKF6                    1520
#define PSMC3BLKF7                    1521
#define PSMC3FFA                      1522
#define PSMC3FFA0                     1523
#define PSMC3FFA1                     1524
#define PSMC3FFA2                     1525
#define PSMC3FFA3                     1526
#define PSMC3STR0                     1527
#define P3STRA                        1528
#define P3STRB                        1529
#define PSMC3STR1                     1530
#define P3HSMEN                       1531
#define P3LSMEN                       1532
#define P3SSYNC                       1533
#define STATUS_SHAD                   1534
#define C_SHAD                        1535
#define DC_SHAD                       1536
#define Z_SHAD                        1537
#define WREG_SHAD                     1538
#define BSR_SHAD                      1539
#define PCLATH_SHAD                   1540
#define FSR0L_SHAD                    1541
#define FSR0H_SHAD                    1542
#define FSR1L_SHAD                    1543
#define FSR1H_SHAD                    1544
#define STKPTR                        1545
#define TOSL                          1546
#define TOSH                          1547

#endif // _PIC16LF1786_H_
